Revit 2027 API
Form.HasOneOrMoreReferenceProfiles Property
Tell if the form has any reference profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasOneOrMoreReferenceProfiles { get; }
Public ReadOnly Property HasOneOrMoreReferenceProfiles As Boolean
	Get
public:
property bool HasOneOrMoreReferenceProfiles {
	bool get ();
}
member HasOneOrMoreReferenceProfiles : bool with get
Property Value
Boolean
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace